---
title:  "Mac OS下 C、C++程序发生CoreDumped后core文件的位置"
date:   2016-02-08 13:44:16
categories: jekyll update
---

### 一，什么是coredump

    我们经常听到大家说到程序core掉了，需要定位解决，这里说的大部分是指对应程序由于各种异常或者bug导致在运行过程中异常退出或者中止，并且在满足一定条件下（这里为什么说需要满足一定的条件呢？下面会分析）会产生一个叫做core的文件。
    
    通常情况下，core文件会包含了程序运行时的内存，寄存器状态，堆栈指针，内存管理信息还有各种函数调用堆栈信息等，我们可以理解为是程序工作当前状态存储生成第一个文件，许多的程序出错的时候都会产生一个core文件，通过工具分析这个文件，我们可以定位到程序异常退出的时候对应的堆栈调用等信息，找出问题所在并进行及时解决。

### 二，coredump文件的存储位置
	Linux下 core文件默认的存储位置与对应的可执行程序在同一目录下，文件名是core.xxx，xxx是进程id号，也可以通过下面的命令看到core文件的存在位置：
   cat  /proc/sys/kernel/core_pattern

	##但是注意！
	Mac下的core文件的位置根本不是当前目录，默认路径是/core/，没错，在根目录下。
	Mac下也没有 /proc/sys/kernel/core_pattern 让你查看，所以 这个坑真的得帮大家填上，否则白白浪费时间思考为什么没有core文件，明明已经 ulimit -c unlimited 了。